# Tips and Trick Python Pandas 04 !

# Columns Selection

# Import Module

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__) #print versi pandas
print(np.__version__) #print versi numpy

1.2.4
1.20.1

# Buat Data Frame

In [3]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float') # konversi pecahan ke tipe data float

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H') #  index bertipe data date time ( H = jam)

df = df.reset_index() # generate index baru berupa integer

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          3.0         15    A
1 2000-01-01 01:00:00         17.0         17    B
2 2000-01-01 02:00:00         15.0          7    C
3 2000-01-01 03:00:00          4.0         18    D
4 2000-01-01 04:00:00         19.0          7    E

# Check Tipe Data

In [6]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Menampilkan Kolom bertipe data `Numerik` saja

In [9]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          3.0         15
1         17.0         17
2         15.0          7
3          4.0         18
4         19.0          7

# Menampilkan Kolom bertipe data `Float` saja

In [10]:
df.select_dtypes(include='float')

   bil_pecahan
0          3.0
1         17.0
2         15.0
3          4.0
4         19.0

# Menampilkan Kolom bertipe data `Integer` saja

In [11]:
df.select_dtypes(include='int')

   bil_bulat
0         15
1         17
2          7
3         18
4          7

# Menampilkan Kolom bertipe data `String` saja

In [12]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Menampilkan Kolom bertipe data `Date Time` saja

In [13]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

# Menampilkan Kolom bertipe data `KOMBINASI`

In [14]:
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          3.0         15    A
1         17.0         17    B
2         15.0          7    C
3          4.0         18    D
4         19.0          7    E